tests/HTMLReport/statistics.json
{
  "JSR223 Sampler - JMeter Props" : {
    "transaction" : "JSR223 Sampler - JMeter Props",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 825.0,
    "medianResTime" : 825.0,
    "minResTime" : 825.0,
    "maxResTime" : 825.0,
    "pct1ResTime" : 825.0,
    "pct2ResTime" : 825.0,
    "pct3ResTime" : 825.0,
    "throughput" : 1.2121212121212122,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Get by Id" : {
    "transaction" : "Get by Id",
    "sampleCount" : 107,
    "errorCount" : 107,
    "errorPct" : 100.0,
    "meanResTime" : 0.009345794392523364,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.9200000000000017,
    "throughput" : 1.1135741567537754,
    "receivedKBytesPerSec" : 1.2310214310988998,
    "sentKBytesPerSec" : 0.0
  },
  "Get All Items" : {
    "transaction" : "Get All Items",
    "sampleCount" : 116,
    "errorCount" : 116,
    "errorPct" : 100.0,
    "meanResTime" : 0.008620689655172417,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.8299999999999983,
    "throughput" : 1.114912921456307,
    "receivedKBytesPerSec" : 1.2259687007419937,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 825,
    "errorCount" : 825,
    "errorPct" : 100.0,
    "meanResTime" : 1.0533333333333326,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 825.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 6.69599376663853,
    "receivedKBytesPerSec" : 7.372052938425265,
    "sentKBytesPerSec" : 0.0
  },
  "Update item by Id" : {
    "transaction" : "Update item by Id",
    "sampleCount" : 102,
    "errorCount" : 102,
    "errorPct" : 100.0,
    "meanResTime" : 0.0784313725490196,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.095196168960852,
    "receivedKBytesPerSec" : 1.2107051399059419,
    "sentKBytesPerSec" : 0.0
  },
  "Get by Id After Updating" : {
    "transaction" : "Get by Id After Updating",
    "sampleCount" : 98,
    "errorCount" : 98,
    "errorPct" : 100.0,
    "meanResTime" : 0.06122448979591837,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.197619425875912,
    "receivedKBytesPerSec" : 1.323930849698762,
    "sentKBytesPerSec" : 0.0
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 135,
    "errorCount" : 135,
    "errorPct" : 100.0,
    "meanResTime" : 0.06666666666666668,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.2013134360233857,
    "receivedKBytesPerSec" : 1.3209755165647776,
    "sentKBytesPerSec" : 0.0
  },
  "Create_Item" : {
    "transaction" : "Create_Item",
    "sampleCount" : 123,
    "errorCount" : 123,
    "errorPct" : 100.0,
    "meanResTime" : 0.048780487804878044,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.7999999999999972,
    "pct3ResTime" : 1.0,
    "throughput" : 1.1881876756923848,
    "receivedKBytesPerSec" : 1.306542307450806,
    "sentKBytesPerSec" : 0.0
  },
  "Create_User" : {
    "transaction" : "Create_User",
    "sampleCount" : 143,
    "errorCount" : 143,
    "errorPct" : 100.0,
    "meanResTime" : 0.09090909090909094,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.680000000000007,
    "throughput" : 1.2470785223427634,
    "receivedKBytesPerSec" : 1.3749527848876757,
    "sentKBytesPerSec" : 0.0
  }
}